_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cropping2d_1 (Cropping2D)    (None, 90, 320, 3)        0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 90, 320, 3)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 43, 158, 24)       1824      
_________________________________________________________________
batch_normalization_1 (Batch (None, 43, 158, 24)       96        
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 43, 158, 24)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 20, 77, 36)        21636     
_________________________________________________________________
batch_normalization_2 (Batch (None, 20, 77, 36)        144       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 20, 77, 36)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 8, 37, 48)         43248     
_________________________________________________________________
batch_normalization_3 (Batch (None, 8, 37, 48)         192       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 8, 37, 48)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 6, 35, 64)         27712     
_________________________________________________________________
batch_normalization_4 (Batch (None, 6, 35, 64)         256       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 6, 35, 64)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 4, 33, 64)         36928     
_________________________________________________________________
batch_normalization_5 (Batch (None, 4, 33, 64)         256       
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 4, 33, 64)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 8448)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               844900    
_________________________________________________________________
batch_normalization_6 (Batch (None, 100)               400       
_________________________________________________________________
dense_2 (Dense)              (None, 50)                5050      
_________________________________________________________________
batch_normalization_7 (Batch (None, 50)                200       
_________________________________________________________________
dense_3 (Dense)              (None, 10)                510       
_________________________________________________________________
batch_normalization_8 (Batch (None, 10)                40        
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 11        
=================================================================
Total params: 983,403
Trainable params: 982,611
Non-trainable params: 792
_________________________________________________________________
